[{"title":"Hello World","date":"2017-05-15T14:56:03.420Z","path":"2017/05/15/hello-world/","text":"Beautiful In White (Demo)Not sure if you know this不确定你是否清楚But when we first met当我第一次见到你I got so nervous I couldn’t speak我紧张到话都说不清楚In that very moment在那一刻I found the one and我找到了我的唯一my life had found this missing piece终于弥补了我生命中的缺失So as long as I live I love you所以我会永远爱你Will heaven hold you会一直拥抱守护你You look so beautiful in white穿着白色婚纱的你如此美丽动人And from now to my very last breath直到我生命结束This day I’ll cherish我都会铭记这一天You look so beautiful in white Tonight今晚穿着白色婚纱的你是如此美丽动人What we have is timeless我们拥有的是天长地久My love is endless我对你的爱是无穷无尽And with this dream I Say to the world我要把这个梦想告诉全世界You’re my every reason you’re all你是我全部的动力that I believe in你说的我全部相信 With all my heart I mean every word每个字都由心而发So as long as I live I love you所以我会永远爱你Will heaven and hold you会一直拥抱守护你You look so beautiful in white穿着白色婚纱的你如此美丽动人And from now to my very last breath直到我生命结束This day I’ll cherish我都会铭记这一天You look so beautiful in white Tonight今晚穿着白色婚纱的你是如此美丽动人You look so beautiful in white穿着白色婚纱的你如此美丽动人so beautiful in white, Tonight.今晚穿着白色婚纱的你如此美丽动人And if our daughter is what our future holds如果我们以后生了一个女儿I hope she has your eyes我希望她也有你一般的眼睛Finds love like you and I did像你我一样遇到爱Yeah, if she falls in love and we will let her go当她坠入爱河我们就会放手I’ll walk her down the aisle我会牵着她走过婚礼殿堂She looks so beautiful in white她穿着白色婚纱的样子一定也会很美You look so beautiful in white正如你一样So as long as I live I love you所以我会永远爱你Will heaven hold you会一直拥抱守护你You look so beautiful in white穿着白色婚纱的你如此美丽动人And from now to my very last breath直到我生命结束This day I’ll cherish我都会铭记这一天You look so beautiful in white Tonight今晚穿着白色婚纱的你是如此美丽动人You look so beautiful in white Tonight今晚穿着白色婚纱的你是如此美丽动人","tags":[]},{"title":"JavaScript-Day4","date":"2017-05-11T12:30:12.000Z","path":"2017/05/11/JavaScript-Day4/","text":"表单1.没有name属性的的数据不会被提交 操作文件1.HTML 表单中可以上传文件的控件只有一个2.当一个表单包含时，表单的enctype必须指定为multipart/form-data，method必须指定为post，浏览器才能正确编码并以multipart/form-data格式发送表单的数据。3.HTML5的File API提供了 File和 FileReader两个对象来操作文件 AJAX1.如果用表单提交，页面会刷新，一次HTTP请求对应一个页面（不懂）。要让用户留在当前页面，就需要用JavaScript发送请求","tags":[]},{"title":"JavaScript-(Day3)","date":"2017-05-08T13:22:07.000Z","path":"2017/05/08/JavaScript-Day3/","text":"方法1.此处模糊，需要回头看 高阶函数1.本质就是让函数的参数能够接受别的函数，也就是将别的函数当作参数来看待 排序算法1.sort()方法会默认把所有元素转换为String再排序 闭包1.此处不懂，之后看 箭头函数ES6新增函数， =&gt; 简化函数定义 标准对象1.typeof来获取对象类型，可以判断出number、boolean、string、function和undefined这几个类型2.number对象调用toString会报错，对于这种情况 123..toString() 或者(123).toString() 日期1.JavaScript日期问题，月份范围是0~112.时间戳可以精确的表示一个时间 RegExp(正则表达式)1.之后看 JSON1.JSON实际上是JavaScript的一个子集，他只有number 、boolean、string、null、array、object、以上几种任意组合，这几种数据类型，而且定死了字符集必须是UTF-8，JSON的字符串必须使用双引号对象的键也必须使用双引号2.JSON.stringify()方法将对象序列化为JSON格式的字符串，可以传入参数，第一个参数为对象名，第二个参数可以控制如何筛选对象的键值，还可以新建一个函数对键值进行处理，然后将函数传入此处3.JSON.parse()可以将JSON格式的字符串变为JavaScript对象，同时还可以接收一个函数，来转换解析出的属性 面向对象1.JavaScript不区分类和实例的概念，而是通过原型（prototype）来实现面向对象编程。原型继承，class继承等内容不懂。 浏览器对象1.windows对象不仅表示全局作用域，还表示浏览器窗口。有innerWidth和innerHeight两个属性，用于显示网页净高度2.navigator对象表示浏览器信息3.screen对象表示屏幕信息4.location对象表示当前页面URL信息，reload()重新加载页面5.document对象表示当前页面，还有一个cookie属性，是由服务器发送的，用来识别用户。为了安全，服务器端在设置Cookie时，应该始终坚持用httpOnly。（此处需要深入学习） 操作DOM1.DOM操作实际上是由更新、遍历、添加、删除这四个操作组成2.操作之前要先获取节点，通常是通过id class tag来获取，其中id获取到的是唯一的，其他两个是获取到一组，之后再减小范围3.获取节点还可以用 querySelector()和querySelectorAll()来获取 更新DOM1.innerHTML()2.innerText或者innerContent,前者不返回隐藏元素文本，后者全部返回（有点模糊） 插入DOM1.如果是空的，使用innerHTML即可；如果不是空的，appendChild()添加到父节点最后一个子节点，此时原来的会被删除。也可以先创建一个新节点，然后再插入2.insertBefore插入到指定位置 parentElement.insertBefore(newElement, referenceElement) 删除DOM1.删除一个DOM需要先获取父节点和它本身节点，之后用removeChild()删除","tags":[]},{"title":"JavaScript-Day2","date":"2017-05-05T13:02:58.000Z","path":"2017/05/05/JavaScript-Day2/","text":"对象1.对象是一种无序的集合数据类型，由键值对组成2.访问属性可以用 对象名.属性名来实现，当属性名包含特殊字符时，需要将它用 ‘’括起来，访问该属性时必须用 对象名[‘属性’]来访问，所以一般情况属性名都尽量使用标准属性名3.实际上所有的属性都是字符串，也就是键都是字符串，而属性值可以是任意的数据类型4.可以用 in 来判断一个对象是否拥有某个属性 ：var a = { name : ‘哈哈’};‘name’ in a; //此处返回的是 ‘true’另外，hasOwnProperty(‘name’)可以判定该属性是自己有的，还是继承而来的5.JavaScipt把 null undefined 0 NAN 和空字符串 ‘’视为 false,其他的一律为 true循环1.主要注意for in 循环，可以将所有属性循环出来 for ( var key in 对象) ，如果想过滤点继承的属性，利用hasOwnProperty()方法 注意，Map Set iterable不清楚，后面需要重新学习，这是ES6的内容变量1.JavaScript会先扫描整个函数体语句，将所有申明的变量“提升”到函数顶部常量1.声明常量的话一般变量名全部大写，ES6中用 conet PI = 3.14;","tags":[]},{"title":"JavaScript(Day1)","date":"2017-05-04T13:54:05.000Z","path":"2017/05/04/JavaScript-Day1/","text":"字符串1，ES6新增模板字符串用来连接多个字符串，如下：var name = “小明”;var age = “30”;var message = “你好,${name},你今年${age}岁了”;2，字符串是不可变的，对字符串的某个索引赋值不会有错误，但是也不会有效果3，一些方法：toUpperCase() 全部变为大写，toLowerCase()全部变为小写，indexOf(“hello”)指定字符串出现的位置，substring(0,9)指定索引区间的子串（此处不包括9） 数组1，直接给Array的length赋值会改变数组的大小；通过索引赋值同样会改变数组的大小，这两点应尽量避免2，slice(0,9)截取数组，返回的是一个新的数组，原来的数组不改变，同样的也不包括9，如果没有传入参数，将会复制该数组3，push(“a”,”b”)向数组末尾添加元素，pop()删除数组最后一个元素；unshift(“a”,”b”)和shift()与之相反4，sort()对数组自动排序，也可以按指定顺序排序5，reverse()数组颠倒6，splice()万能方法， splice(2,2,”你好”,”很好”) 从索引2开始删除2个元素，同时从索引2添加两个元素，也可以只删除不添加，只添加不删除！！！！7，concat([1,2,3]) 将当数组和concat()里的数组连接起来，当concat()里面有元素也有数组时，会自动将里面的数组拆开，连接到原数组中8，join(“-“)将当前数组的每个元素都用指定的字符串连接起来，返回的是连接后的字符串","tags":[]},{"title":"再次出发","date":"2017-05-04T13:07:15.000Z","path":"2017/05/04/再次出发/","text":"又过去了两个月。最后还是顶不住压力又找了份老本行的工作，比起以前的工作有了一点点起色吧。换了个环境，和工厂不一样的生活。可是这还不够啊，差得好远。将近两个月的适应，新工作开始进入状态，终于有时间重新开始。没有更多的时间浪费了。每天要变得更好，坚持下去，不管多难。","tags":[]},{"title":"小米首页","date":"2017-02-21T03:50:44.000Z","path":"2017/02/21/小米首页/","text":"网页结构由于页面各个部分的背景色有所区别，为了方便设置将页面分为了四个部分：头部(header)、主要内容-上半部分(main-top)、主要内容-下半部分(main-bottom)、底部(footer)。 头部：页面顶部的超链接、登录注册以及购物车。背景为黑色。 上半部分：由四个小的div组成：水平导航+搜索框、轮播图+左侧导航菜单、轮播图底部图片展示、小米明星单品。背景为白色。 下半部分：智能硬件、其他内容两部分。背景为灰色。 底部：售后服务、版权等信息。背景白色。 页面编写 头部头部的超链接导航和登录注册部分用两个无序列表完成。其中购物车添加一个下滑菜单。 上半部分logo和搜索 logo和搜索比较简单，分布到两侧，按照诚衣首页的方法布局就可以完成。 水平导航 水平导航也是用无序列表来写。但是每一个导航元素还有一个下滑菜单进行展示。所以要在每一个li元素内部嵌套一个列表，用来放置展示内容。 将所有的二级列表隐藏，通过脚本控制下拉、收起等动作。 左侧导航菜单 左侧垂直导航菜单用列表写，每一个li元素都有一个二级菜单。默认状态时隐藏，鼠标滑入显示，移出隐藏。原理和购物车一样。需要注意的是它和轮播图是在一个框架内的，也就是相互重叠，导航菜单的背景色随轮播图变化，所以要将一级菜单的背景色设为透明。 大轮播图 大轮播图直接套用写好的淡入淡出轮播图即可。需要注意的是导航菜单、轮播图、二级菜单、水平导航菜单的二级菜单这几个部分都有重叠的部分，所以需要根据展示效果灵活设置z-index的值，是他们不会相互影响。 轮播图底部图片链接 根据尺寸做好布局就可以。最左侧的div里嵌套一个列表就可以完成，小图标是从easyicon找的。 明星单品 此处是一个只有两页的左右轮播图。在每一个li里面嵌套5个dl自定义列表完成。不需要数字按钮，只需要前进后退按钮。需要注意的问题是它是自动轮播的，间隔相同的时间左右交替显示。开始的时候只知道要用到计时器，但是做不到间隔相同时间自动轮播。之后才想到要用到setTimeout()和setInterval()两种计时器。就可以实现功能。 下半部分智能硬件 智能硬件部分增加了新的内容。鼠标滑入的时候有一个悬浮效果。 默认状态悬浮状态 这里使用脚本来模拟：鼠标滑入div后，首先添加阴影，之后让其向上移动一段距离，评价卡片滑出。这样就可以模拟出悬浮效果。鼠标移出后，恢复原样。 这里需要注意的是：最开始的时候卡片外层没有添加列表，造成的结果就是鼠标滑入后所有的卡片都运动。之后依靠列表li的索引才能精确定位。 其他内容 如图： 结构分析：最外层使用了ul列表来放置四个项目;每个项目中又有一个小的轮播图，也使用了一个ul列表；而且每个轮播图还有圆圈按钮，用了一个ol列表。三个列表相互嵌套，使得结构比较麻烦，不容易定位到要操作的元素。造成的结果就是最开始轮播只要操作一个小轮播图，其他的轮播图要么不动，要么一起运动。查阅jQuery手册后发现可以通过each()先遍历最外层li，之后再操作轮播图比较好实现。 这样只需要编写小轮播图的代码就可以完成功能。不会互相影响。 底部 通过dl自定义列表完成，比较简单。 网页及代码网页地址：小米首页代码地址：GitHub","tags":[]}]